In [1]:
import pandas as pd

In [2]:
# Load csv file 

jeopardy_df= pd.read_csv('jeopardy.csv')
pd.set_option('display.max_colwidth', -1)

In [3]:
jeopardy_df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams

In [4]:
# Rename the columns, eliminating dead speace 
jeopardy_df.rename(columns={
    ' Air Date': 'Air Date',
    ' Round': 'Round',
    ' Category': 'Category',
    ' Value': 'Value',
    ' Question': 'Question',
    ' Answer': 'Answer'
}, inplace=True)

In [5]:
# Clean dataframe 
jeopardy_df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams

In [7]:
def filter_data(data, words):
    # Lowercases all words in the list of words as well as the questions. Returns true is all of the words in the list appear in the question.
    filter = lambda x: all(word.lower() in x.lower() for word in words)
    # Applies the labmda function to the Question column and returns the rows where the function returned True
    
    return data.loc[data["Question"].apply(filter)]

In [9]:
filtered_df = filter_data(jeopardy_df,['King', 'England'])

In [11]:
filtered_df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
4953,3003,1997-09-24,Double Jeopardy!,"""PH""UN WORDS",$200,"Both England's King George V & FDR put their stamp of approval on this ""King of Hobbies""",Philately (stamp collecting)
6337,3517,1999-12-14,Double Jeopardy!,Y1K,$800,"In retaliation for Viking raids, this ""Unready"" king of England attacks Norse areas of the Isle of Man",Ethelred
9191,3907,2001-09-04,Double Jeopardy!,WON THE BATTLE,$800,This king of England beat the odds to trounce the French in the 1415 Battle of Agincourt,Henry V
11710,2903,1997-03-26,Double Jeopardy!,BRITISH MONARCHS,$600,"This Scotsman, the first Stuart king of England, was called ""The Wisest Fool in Christendom""",James I
13454,4726,2005-03-07,Jeopardy!,A NUMBER FROM 1 TO 10,$1000,It's the number that followed the last king of England named William,4

In [14]:
# Adding a new column. If the value of the float column is not "None", 
# then we cut off the first character (which is a dollar sign), 
# and replace all commas with nothing, and then cast that value to a float. 
# If the answer was "None", then we just enter a 0.

jeopardy_df["Float Value"] = jeopardy_df["Value"].apply(lambda x: float(x[1:].replace(',','')) if x != "None" else 0)

In [16]:
# Filtering the dataset and finding the average value of those questions
filtered = filter_data(jeopardy_df, ["King"])
print(filtered["Float Value"].mean())

771.8833850722094

In [17]:
# A function to find the unique answers of a set of data
def get_answer_counts(data):
    return data["Answer"].value_counts()

In [18]:
# Testing the answer count function
print(get_answer_counts(filtered))

Henry VIII                         55
Solomon                            35
Richard III                        33
Louis XIV                          31
David                              30
Sweden                             28
Norway                             27
Charles I                          19
Belgium                            19
Tonga                              18
George III                         18
Charlemagne                        17
Scotland                           17
France                             17
Saudi Arabia                       16
Saul                               16
Portugal                           16
Denmark                            16
King Lear                          15
Louis XVI                          15
Spain                              15
Thailand                           14
Memphis                            14
Alexander the Great                13
Italy                              13
James I                            13
Nebuchadnezzar                     13
King Arthur                        13
Morocco                            13
Frederick the Great                12
                                   ..
the Declaration of Independence    1
The Cat in the Hat                 1
a dream                            1
ATMs                               1
Van Gogh                           1
dynamite                           1
the 27th Amendment                 1
Afghanistan                        1
Logging onto the Internet          1
Manuel Noriega (Panama)            1
blintzes                           1
Pull up stakes                     1
Holy Roman Empire                  1
"(Let there be) light"             1
Monopoly                           1
Edna St. Vincent Millay            1
icebergs                           1
Earl                               1
King Hassan                        1
the Constitution                   1
Michigan                           1
Goblet                             1
July 4, 1776                       1
hackysacks                         1
counties                           1
Psychiatrist                       1
herding dogs                       1
Laertes                            1
(Harper) Lee                       1
Mad Men                            1
Name: Answer, Length: 5268, dtype: int64